################################################################################
#
# Copyright (c) 2010-2018 Aldec, Inc.
# All Rights Reserved.
#
################################################################################
#
# Description:  Design Constraints
# Generated by: ALINT-PRO version 2018.07.1720 SU1
# Project:      'OCT_FPGA_proj'
# Output file:  'D:/Design_A/Marilyn_FPGA/Marilyn_OCT_FPGA_v0004_20190610/checker/OCT_FPGA.sdc'
# Date:         Mon Jun 10 10:26:41 2019
#
################################################################################


################################################################################
# Clocks
################################################################################


#### Existing constraints ####

# none


#### Derived constraints ####

# none


#### Suggested constraints ####

# External clocks
create_clock -period 10 -name OCT_TOP/FPGA_CLOCK [ get_ports FPGA_CLOCK ]
create_clock -period 10 -name OCT_TOP/nRD_n2 [ get_ports nRD_n2 ]
create_clock -period 10 -name OCT_TOP/nWRn3 [ get_ports nWRn3 ]

# Internal clocks
create_clock -period 10 -name OCT_TOP/U_GAL_CON/CSTM_MOVE_END_out [ get_pins U_GAL_CON/CSTM_MOVE_END_out/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/Gal_clk [ get_pins U_GAL_CON/Gal_clk/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/Hsync [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_Hsync/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/TRIG [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_TRIG/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/sig_VH_Gen_EN [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_SLD_Gen_EN/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/U_marilyn_vhsync_gen/Hsync [ get_pins U_GAL_CON/U_marilyn_vhsync_gen/r_hsync_ff2/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_D_inc_25_latch_clk [ get_pins U_GAL_CON/sig_D_inc_25_latch_clk/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_Raster_Scan_CNT_UP_clk [ get_pins U_GAL_CON/sig_Raster_Scan_CNT_UP_clk/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_Raster_Y_inc_clk [ get_pins U_GAL_CON/sig_Raster_Y_inc_clk/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_RetryFlag1_EN [ get_pins U_GAL_CON/sig_RetryFlag1_EN/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_RetryFlag2_EN [ get_pins U_GAL_CON/sig_RetryFlag2_EN/Q ]
create_clock -period 10 -name OCT_TOP/U_GAL_CON/sig_TRIG_EN [ get_pins U_GAL_CON/sig_TRIG_EN/Q ]
create_clock -period 10 -name {OCT_TOP/U_GPIO_cstm/\AND:2/O} [ get_pins {{U_GPIO_cstm/\AND:2/O}} ]

# Generated clocks
create_generated_clock -source [ get_ports FPGA_CLOCK ] -invert -name OCT_TOP/U_GAL_CON/n_FPGAclk [ get_pins {{U_GAL_CON/\INV:1/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/CSTM_MOVE_END_out/Q ] -invert -name {OCT_TOP/U_comp_CustomScan/\INV:144/O} [ get_pins {{U_comp_CustomScan/\INV:144/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/CSTM_MOVE_END_out/Q ] -invert -name {OCT_TOP/U_comp_CustomScan/\INV:151/O} [ get_pins {{U_comp_CustomScan/\INV:151/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/Gal_clk/Q ] -invert -name OCT_TOP/U_GAL_CON/n_Gal_clk [ get_pins {{U_GAL_CON/\INV:85/O}} ]
create_generated_clock -source [ get_pins {{U_GAL_CON/\INV:85/O}} ] -invert -name {OCT_TOP/U_GAL_CON/U_marilyn_vhsync_gen/\INV:2/O} [ get_pins {{U_GAL_CON/U_marilyn_vhsync_gen/\INV:2/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_Hsync/Q ] -invert -name {OCT_TOP/U_GAL_CON/\INV:86/O} [ get_pins {{U_GAL_CON/\INV:86/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_TRIG/Q ] -invert -name {OCT_TOP/U_comp_TRIG_SEL/\INV:2/O} [ get_pins {{U_comp_TRIG_SEL/\INV:2/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_SLD_Gen_EN/Q ] -invert -name {OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/\INV:2/O} [ get_pins {{U_GAL_CON/U_comp_VHsync_gen/\INV:2/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/U_comp_VHsync_gen/sig_SLD_Gen_EN/Q ] -invert -name {OCT_TOP/U_GAL_CON/\INV:100/O} [ get_pins {{U_GAL_CON/\INV:100/O}} ]
create_generated_clock -source [ get_pins U_GAL_CON/U_marilyn_vhsync_gen/r_hsync_ff2/Q ] -invert -name {OCT_TOP/U_GAL_CON/\INV:86/O_2} [ get_pins {{U_GAL_CON/\INV:86/O}} ]
create_generated_clock -source [ get_pins {{U_GPIO_cstm/\AND:2/O}} ] -invert -name OCT_TOP/U_GPIO_cstm/cstm_nWE [ get_pins {{U_GPIO_cstm/\INV:4/O}} ]
create_generated_clock -source [ get_pins {{U_GPIO_cstm/\INV:4/O}} ] -invert -name {OCT_TOP/U_comp_CustomScan/\INV:23/O} [ get_pins {{U_comp_CustomScan/\INV:23/O}} ]
create_generated_clock -source [ get_ports nRD_n2 ] -invert -name {OCT_TOP/U_GPIO/\INV:41/O} [ get_pins {{U_GPIO/\INV:41/O}} ]


################################################################################
# Clock groups
################################################################################


#### Existing constraints ####

# none


#### Suggested constraints ####

# Asynchronous clock groups
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/FPGA_CLOCK OCT_TOP/U_GAL_CON/n_FPGAclk} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/CSTM_MOVE_END_out {OCT_TOP/U_comp_CustomScan/\INV:144/O} {OCT_TOP/U_comp_CustomScan/\INV:151/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/Gal_clk OCT_TOP/U_GAL_CON/n_Gal_clk {OCT_TOP/U_GAL_CON/U_marilyn_vhsync_gen/\INV:2/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/Hsync {OCT_TOP/U_GAL_CON/\INV:86/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/TRIG {OCT_TOP/U_comp_TRIG_SEL/\INV:2/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/sig_VH_Gen_EN {OCT_TOP/U_GAL_CON/U_comp_VHsync_gen/\INV:2/O} {OCT_TOP/U_GAL_CON/\INV:100/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/U_GAL_CON/U_marilyn_vhsync_gen/Hsync {OCT_TOP/U_GAL_CON/\INV:86/O_2}} ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_D_inc_25_latch_clk ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_Raster_Scan_CNT_UP_clk ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_Raster_Y_inc_clk ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_RetryFlag1_EN ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_RetryFlag2_EN ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/U_GAL_CON/sig_TRIG_EN ]
set_clock_groups -asynchronous -group [ get_clocks {{OCT_TOP/U_GPIO_cstm/\AND:2/O} OCT_TOP/U_GPIO_cstm/cstm_nWE {OCT_TOP/U_comp_CustomScan/\INV:23/O}} ]
set_clock_groups -asynchronous -group [ get_clocks {OCT_TOP/nRD_n2 {OCT_TOP/U_GPIO/\INV:41/O}} ]
set_clock_groups -asynchronous -group [ get_clocks OCT_TOP/nWRn3 ]


################################################################################
# Clock I/O
################################################################################


#### Existing constraints ####

# none


#### Suggested constraints ####

# Input delays
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports DIP_SW ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports D ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports FPGA_RESET ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports GPIO1_IN ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nCS1n ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nFOCUS_FAULT_D_LINE_ON_OFF ]
set_input_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nREF_POLA_FAULT_POLA_AN ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[0]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[0]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[1]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[1]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[2]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[2]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[3]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[3]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[4]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[4]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[5]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[5]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[6]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[6]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[7]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[7]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[8]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[8]}} ]
set_input_delay -clock OCT_TOP/nRD_n2 -clock_fall -add_delay 5 [ get_ports {{A[9]}} ]
set_input_delay -clock OCT_TOP/nWRn3 -clock_fall -add_delay 5 [ get_ports {{A[9]}} ]

# Output delays
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports CIBT3_Hsync ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports CIBT3_Vsync ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports CP9_D_LINE_AP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports D ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports FOCUS_SLEEP_POLA_ON_OFF ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_GAIN_CLK ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_GAIN_SDI ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_OS_DIN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_OS_SCLK ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_SCLK ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports Galv_SDIN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports KEISEN_TXD ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports LineCCD_ONOFF ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports LineCCD_Trig ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports MOT_DIR ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports MOT_ENABLE ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports MOT_PHA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports MOT_PWMSW ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports OCTFOCUS_IN1_OCTF_AP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports OCTFOCUS_IN2_OCTF_BP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports OCTF_AN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports OCTF_BN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports OCTF_ON_OFF ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports PER_N ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports PER_P ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports PER_REF_DIN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports PER_REF_SCLK ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports POLA_IN1_POLA_AP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports POLA_IN2_POLA_BP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports P_SW_AN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports P_SW_AP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports P_SW_BN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports P_SW_BP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports P_SW_ON_OFF ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports REF_IN1_D_LINE_AN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports REF_IN2_D_LINE_BN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports REF_POLA_RESET_POLA_BN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports RETRY_FLAG1 ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports RETRY_FLAG2 ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports SLD_ACTIVE_PERIOD ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports SLD_REF_DIN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports SLD_REF_SCLK ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nDRV8841_SLEEP_D_LINE_BP ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nFOCUS_FAULT_D_LINE_ON_OFF ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nGalvX_GAIN_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nGalvX_OS_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nGalvX_SYNC ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nGalvY_OS_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nGalvY_SYNC ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ1_FPGA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ2_FPGA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ3_FPGA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ4_FPGA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ8_FPGA ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nPER_RES_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nREF_POLA_FAULT_POLA_AN ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nSLD_LIMIT_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nSLD_REF_CS ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports SLD_PULSE ]
set_output_delay -clock OCT_TOP/U_GAL_CON/n_FPGAclk -add_delay 5 [ get_ports SLD_PULSE ]
set_output_delay -clock OCT_TOP/FPGA_CLOCK -add_delay 5 [ get_ports nIRQ5_FPGA ]
set_output_delay -clock OCT_TOP/U_GAL_CON/n_FPGAclk -add_delay 5 [ get_ports nIRQ5_FPGA ]


################################################################################
# Timing path exceptions
################################################################################


#### Existing constraints ####

# none


#### Suggested constraints ####

# none
