################################################################################
#
# Copyright (c) 2010-2018 Aldec, Inc.
# All Rights Reserved.
#
################################################################################
#
# Description:  Design Constraints
# Generated by: ALINT-PRO version 2018.07.1720 SU1
# Project:      'OCT_TOP_MARILYN_proj'
# Output file:  'D:/Design_A/Marilyn_FPGA/Marilyn_OCT_FPGA/OCTOptSub-FPGA/checker/OCT_TOP_MARILYN.sdc'
# Date:         Wed Feb 12 14:22:04 2020
#
################################################################################


################################################################################
# Clocks
################################################################################


#### Existing constraints ####

# External clocks
create_clock -period 50 -name fpga_clock [ get_ports FPGA_CLOCK ]


#### Derived constraints ####

# none


#### Suggested constraints ####

# none


################################################################################
# Clock groups
################################################################################


#### Existing constraints ####

# none


#### Suggested constraints ####

# Asynchronous clock groups
set_clock_groups -asynchronous -group [ get_clocks fpga_clock ]


################################################################################
# Clock I/O
################################################################################


#### Existing constraints ####

# Input delays
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports A ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports D ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports DIP_SW ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports ENC_A ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports ENC_B ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports LCMOS_MisTrigger ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports nCS1n ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports nRD_n2 ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports nWRn3 ]
set_input_delay -clock fpga_clock -add_delay 20 [ get_ports FPGA_RESET ]

# Output delays
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ1_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ2_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ3_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ4_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ5_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ6_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nIRQ7_FPGA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nGalvX_SYNC ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nGalvY_SYNC ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_SCLK ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_SDIN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nGalvX_GAIN_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_GAIN_SDI ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_GAIN_CLK ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nGalvX_OS_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nGalvY_OS_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_OS_DIN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports Galv_OS_SCLK ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports LCMOS_Hsync ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports SLD_REF_SCLK ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports SLD_REF_DIN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nSLD_REF_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nSLD_LIMIT_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports PER_REF_SCLK ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports PER_REF_DIN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports nPER_RES_CS ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports SLD_PULSE ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D_LINE_AP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D_LINE_BP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D_LINE_AN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D_LINE_BN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D_LINE_ON_OFF ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports POLA_AP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports POLA_BP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports POLA_AN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports POLA_BN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports POLA_ON_OFF ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports OCTF_AP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports OCTF_BP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports OCTF_AN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports OCTF_BN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports OCTF_ON_OFF ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports P_SW_AP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports P_SW_BP ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports P_SW_AN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports P_SW_BN ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports P_SW_ON_OFF ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports MOT_PWMSW ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports MOT_ENABLE ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports MOT_DIR ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports MOT_PHA ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports CP8 ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports CP9 ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports CP10 ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports CP11 ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports CP12 ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports D ]
set_output_delay -clock fpga_clock -add_delay 20 [ get_ports RDnWR ]


#### Suggested constraints ####

# none


################################################################################
# Timing path exceptions
################################################################################


#### Existing constraints ####

# none


#### Suggested constraints ####

# none
